; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared1 - mode
	thermograph2 - mode
	spectrograph4 - mode
	thermograph6 - mode
	infrared5 - mode
	infrared0 - mode
	image3 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared1)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared5)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star6)
	(supports instrument3 image3)
	(supports instrument3 infrared5)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared5)
	(supports instrument6 image3)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
)
(:goal (and
	(pointing satellite1 Star11)
	(have_image Phenomenon7 image3)
	(have_image Star8 thermograph6)
	(have_image Planet9 thermograph6)
	(have_image Planet9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Planet10 thermograph6)
	(have_image Star11 infrared0)
	(have_image Star12 infrared5)
	(have_image Star12 thermograph2)
))

)

; plan
1. (turn_to satellite2 groundstation1 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 10
3. (calibrate satellite2 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 10
4. (turn_to satellite2 star12 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star12)
   goals met: 0 of 10
5. (take_image satellite2 star12 instrument6 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 1 of 10
6. (take_image satellite2 star12 instrument6 infrared5)
   added: (have_image star12 infrared5)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon7 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 10
8. (turn_to satellite0 groundstation5 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 10
9. (take_image satellite2 phenomenon7 instrument6 image3)
   added: (have_image phenomenon7 image3)
   goals met: 3 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
11. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 3 of 10
12. (turn_to satellite0 planet10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet10)
   goals met: 3 of 10
13. (take_image satellite0 planet10 instrument0 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 4 of 10
14. (take_image satellite0 planet10 instrument0 thermograph6)
   added: (have_image planet10 thermograph6)
   goals met: 5 of 10
15. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 5 of 10
16. (take_image satellite0 planet9 instrument0 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 6 of 10
17. (take_image satellite0 planet9 instrument0 thermograph6)
   added: (have_image planet9 thermograph6)
   goals met: 7 of 10
18. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 7 of 10
19. (take_image satellite0 star11 instrument0 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 10
20. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 8 of 10
21. (take_image satellite0 star8 instrument0 thermograph6)
   added: (have_image star8 thermograph6)
   goals met: 9 of 10
22. (turn_to satellite1 star11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star11)
   goals met: 10 of 10
